# Рефлексия:
# 3.1: В первую очередь бросается в глаза то , что можно было сразу при создании файла в цикле присвоить ему текстовое значение в свойствах и создавать кажждый файл одной командой, как это сделал я. Также вижу, что я не указал, что каждый файл открывается в текстовом виде. И не использовал второй цикл, но три строчки это не страшно. Также мог бы использовать простую эталонную запись уравнения "x = str(random.randint(1,100))", но так как о ней не догадался - наказал себя более долгим и сложным решением.

# 3.2:
# Вижу, что неправильно организовал функцию. Нужно было использовать две функции, а не одну. И не выполнил условия задачи - получить на вход функции три значения - путь и два случайных числа.

# 3.3:
# Вижу интересную запись "s.rstrip().split(" ")" - не знал, что так можно, в таком случае возможно бы смог решить задачу через цикл, а не через условие. Также вижу , как я мог бы вывести ошибку в конкретной строке(потому что в случае ошибки нужно искать ее самому)

