#4. Сделайте тесты, проверяющие, как работают put(), is_key() и get():
#- добавление значения по новому ключу и добавление значения по уже существующему ключу с проверками что записалось, проверка присутствующего и отсутствующего ключей, извлечение значения по существующему и отсутствующему ключу.
# добавил 4 задание в тесты 9-3.py

#5.* Реализуйте словарь с использованием упорядоченного списка по ключу для оптимизации производительности поиска. Оцените временную сложность операций вставки, удаления и поиска в таком словаре.

# Пока не приходи в голову решение, займусь 13.01

#6.* Создайте словарь, в котором ключи представлены битовыми строками фиксированной длины. Реализуйте методы добавления, удаления и поиска элементов, используя битовые операции для ускорения работы.

# Решение примерно представляю, сделаю также 13.01