#3Реализуйте алгоритм инвертирования дерева: надо сделать так, чтобы слева от главного узла были значения больше него, а справа — меньше.
https://skillsmart.ru/algo/15-121-cm/inv.png
#4.* Добавьте метод, который находит уровень в текущем дереве, сумма значений узлов на котором максимальна. Подумайте, как оптимизировать решение, чтобы производительность была достаточной даже для больших деревьев.

#5.* Учитывая результаты обхода дерева в префиксном и инфиксном порядке, разработайте функцию для восстановления оригинального дерева.
#Например,
#префиксный массив: [1,2,4,5,3,6,7]
#инфиксный массив: [4,2,5,1,6,3,7]

#спойлер
#Объясните, почему обязательно нужны оба обхода для однозначного построения дерева.